[
  {
    "catFr": "Réaliser un développement",
    "catEng": "Develop an application",
    "texts": [
      {
        "titleFr": "Choisir et implémenter les architectures adaptées",
        "titleEng": "Choose and implement adapted architectures",
        "id": 0,
        "fr": "À travers tous mes projets personnels, j'ai dû faire des choix sur les technologies que j'utilisais. Ces choix étaient principalement basés sur ce que je voulais apprendre ou la facilité de ce que je connaissais déjà. En entreprise, j'ai pu implémenter des architectures et des technologies bien plus complexes et surtout complètes, notamment la Microservice architecture et la Clean architecture.",
        "eng": "Through all my personal projects, I had to make choices on the technologies I used. These choices were mainly based on what I wanted to learn or made for the ease of what I already knew. While working in a real professional setting, I was able to implement much more complex and complete architectures and technologies, in particular the Microservice and Clean architectures."
      },
      {
        "titleFr": "Faire évoluer une application existante",
        "titleEng": "Develop on an existing application",
        "id": 0,
        "fr": "La mission que j'ai intégrée lors de mon insertion dans le monde du travail était déjà bien avancée dans les étapes de développement. J'ai pu la faire évoluer en ajoutant des tests unitaires, des tests contractuels, des fonctionnalités ainsi qu'en réparant des bugs, tout au long de mes 26 semaines avec l'équipe (séparées en 2 stages sur 2 ans).",
        "eng": "The mission that I joined during my internships was already well advanced in the development stages. I was able to contribute to it by adding unit tests, contract tests, new features as well as fixing bugs, throughout my 26 weeks with the team (separated into 2 internships over 2 years)."
      },
      {
        "titleFr": "Intégrer des solutions dans un environnement de développement, de test ou de production",
        "titleEng": "Integrate solutions into an environment",
        "id": 0,
        "fr": "Pour mes projets personnels et universitaires, ainsi que pendant mes stages, j'ai utilisé GitHub pour la gestion de version. La majorité de mes projets personnels étaient hébergés sur un serveur Debian que j'avais créé moi-même en utilisant un vieil ordinateur non utilisé. Ils sont maintenant hébergés sur un serveur Raspberry Pi que je continue à maintenir constamment.",
        "eng": "For my personal and academic projects, as well as during my internships, I used GitHub for version management. The majority of my personal projects were hosted on a Debian server that I created myself using an old, unused computer. They are now hosted on a Raspberry Pi server, which I continue to maintain constantly."
      }
    ]
  },
  {
    "catFr": "Optimiser des applications",
    "catEng": "Optimize applications",
    "texts": [
      {
        "titleFr": "Profiler, analyser et justifier le comportement d’un code existant",
        "titleEng": "Profile, analyse and justify the behaviour of existing code",
        "id": 0,
        "fr": "En entreprise, pour travailler et ajouter sur le code existant de l'application en construction, j'ai dû comprendre son implémentation, mais aussi le raisonnement venant en amont. En commençant par la rédaction de tests unitaires sur ce code, j'ai pu facilement m'adapter aux technologies et aux structures ainsi qu'aux syntaxes standards qu'utilise l'équipe.",
        "eng": "During my internships, to work and add to the existing code of the application under construction, I had to understand its implementation, but also the reasoning behind it. Starting with writing some missing unit tests on the existing code, I was able to easily adapt to the technologies and structures, as well as the different general syntaxes that the team uses."
      },
      {
        "titleFr": "Choisir et utiliser des bibliothèques et méthodes dédiées au domaine d’application",
        "titleEng": "Choose and use libraries or methods dedicated to the application domain",
        "id": 0,
        "fr": "Comme pour le choix de l'architecture et des technologies, j'ai pu expérimenter avec la prise de décision pour mes projets personnels. J'ai ensuite pu profiter d'une expérience plus poussée sur l'implémentation de bibliothèques plus complexes et complètes. J'ai aussi pu interroger l'équipe sur le raisonnement derrière leur choix.",
        "eng": "Just like with the choices of architecture and technologies, I was able to experiment with decision-making in the scope of my personal projects. I was later able to benefit from more in-depth experience in the implementation of more complex and complete libraries during my internships. I was also able to ask the team directly about the reasoning behind their choices."
      }
    ]
  }
]